/* A Bison parser, made by GNU Bison 2.4.2.  */

/* Skeleton implementation for Bison's Yacc-like parsers in C

      Copyright (C) 1984, 1989-1990, 2000-2006, 2009-2010 Free Software
   Foundation, Inc.

   This program is free software: you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation, either version 3 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with this program.  If not, see <http://www.gnu.org/licenses/>.  */

   /* As a special exception, you may create a larger work that contains
      part or all of the Bison parser skeleton and distribute that work
      under terms of your choice, so long as that work isn't itself a
      parser generator using the skeleton or a modified version thereof
      as a parser skeleton.  Alternatively, if you modify or redistribute
      the parser skeleton itself, you may (at your option) remove this
      special exception, which will cause the skeleton and the resulting
      Bison output files to be licensed under the GNU General Public
      License without this special exception.


#define YYPUSH 0

/* Pull parsers.  */
#define YYPULL 1

/* Using locations.  */
#define YYLSP_NEEDED 1

#define YYDEBUG 1

/* Copy the first part of user declarations.  */

/* Line 189 of yacc.c  */
//#line 1 "C:\\Users\\igor8\\source\\repos\\PMDG_AUTO\\AirportData\\sidstar_1.y"

#include <stdio.h>
#include <string>
#include <locale.h>
#include <ssfunc.h>
#include <vector>
void yyerror(char* s) {
  fprintf(stderr, "%s\n", s);
}
extern int ScanToken();
int yylex() { return ScanToken(); };
int countfixes = 0;
int countrnws = 0;



#ifdef YYERROR_VERBOSE
# undef YYERROR_VERBOSE
# define YYERROR_VERBOSE 1
#else
# define YYERROR_VERBOSE 0
#endif


/* Enabling traces.  */
#ifndef YYDEBUG
# define YYDEBUG 0
#endif

/* Enabling verbose error messages.  */
#ifdef YYERROR_VERBOSE
# undef YYERROR_VERBOSE
# define YYERROR_VERBOSE 1
#else
# define YYERROR_VERBOSE 0
#endif

/* Enabling the token table.  */
#ifndef YYTOKEN_TABLE
# define YYTOKEN_TABLE 0
#endif


/* Tokens.  */
#ifndef YYTOKENTYPE
# define YYTOKENTYPE
   /* Put the tokens into the symbol table, so that GDB and other debuggers
      know about them.  */
enum yytokentype {
  RIGHT = 258,
  TURN = 259,
  N260 = 260,
  N261 = 261,
  N262 = 262,
  APPROACHES = 263,
  APPROACH = 264,
  N265 = 265,
  N266 = 266,
  N267 = 267,
  N268 = 268,
  N269 = 269,
  FIXES = 270,
  N271 = 271,
  ENDFIXES = 272,
  SIDS = 273,
  SID1 = 274,
  ENDSIDS = 275,
  STARS = 276,
  STAR = 277,
  ENDSTARS = 278,
  RNWS = 279,
  RNW = 280,
  RNWNUM = 281,
  ENDRNWS = 282,
  NAMEROUTE = 283,
  FIX = 284,
  VAL = 285,
  N286 = 286,
  N287 = 287,
  FROM = 288,
  N289 = 289,
  ATORABOVE = 290,
  ATORBELOW = 291,
  N292 = 292,
  N293 = 293,
  LATLON = 294,
  DIGIN = 295,
  DIGIE = 296,
  N297 = 297,
  N298 = 298,
  TO = 299,
  INTERCEPT = 300,
  UNTIL = 301,
  N302 = 302,
  N303 = 303,
  N304 = 304,
  N305 = 305,
  N306 = 306,
  N307 = 307,
  N308 = 308,
  N309 = 309,
  DIRECT = 310,
  RADIAL = 311,
  SPEED = 312,
  TRK = 313
};
#endif
/* Tokens.  */
#define RIGHT 258
#define TURN 259
#define N260 260
#define N261 261
#define N262 262
#define APPROACHES 263
#define APPROACH 264
#define N265 265
#define N266 266
#define N267 267
#define N268 268
#define N269 269
#define FIXES 270
#define N271 271
#define ENDFIXES 272
#define SIDS 273
#define SID1 274
#define ENDSIDS 275
#define STARS 276
#define STAR 277
#define ENDSTARS 278
#define RNWS 279
#define RNW 280
#define RNWNUM 281
#define ENDRNWS 282
#define NAMEROUTE 283
#define FIX 284
#define VAL 285
#define N286 286
#define N287 287
#define FROM 288
#define N289 289
#define ATORABOVE 290
#define ATORBELOW 291
#define N292 292
#define N293 293
#define LATLON 294
#define DIGIN 295
#define DIGIE 296
#define N297 297
#define N298 298
#define TO 299
#define INTERCEPT 300
#define UNTIL 301
#define N302 302
#define N303 303
#define N304 304
#define N305 305
#define N306 306
#define N307 307
#define N308 308
#define N309 309
#define DIRECT 310
#define RADIAL 311
#define SPEED 312
#define TRK 313


class sV14 {
public:
  char a1[56]; //0
  double sinlat; //56
  double coslat; //64
  double sinlon; //72
  double coslon; //80
  double radlat; //88
  double radlon; //96
  double a14; //104
  double a15; //112
  double a16; //120
  double a17; //128
  double a18; //136
  double a19; //144
  double a20; //152
  double a21; //160
  double a22; //168
  double a23; //176
  double a24; //184
  double a25; //192
  double a26; //200
  __int32 a27; //208
  double a28; //212
  __int32 a29; //220
  double a30; //224
  __int64 m1[45]; //232
  sV14* n;
};

/* Value type.  */
#if ! defined YYSTYPE && ! defined YYSTYPE_IS_DECLARED
union YYSTYPE
{
  //#line 30 "sidstar_1.y"

  char* string;
  double flo;
  char sym;
  //void* fixpoint;
  void* point;
  __int64 int64;

  //#line 248 "y.tab.c"

};
typedef union YYSTYPE YYSTYPE;
# define YYSTYPE_IS_TRIVIAL 1
# define YYSTYPE_IS_DECLARED 1
#endif

#if ! defined YYLTYPE && ! defined YYLTYPE_IS_DECLARED
typedef struct YYLTYPE
{
  int first_line;
  int first_column;
  int last_line;
  int last_column;
} YYLTYPE;
# define yyltype YYLTYPE /* obsolescent; will be withdrawn */
# define YYLTYPE_IS_DECLARED 1
# define YYLTYPE_IS_TRIVIAL 1
#endif

extern YYSTYPE yylval;
extern YYLTYPE yylloc;
/* Copy the second part of user declarations.  */


/* Line 264 of yacc.c  */
//#line 271 "C:\\Users\\igor8\\source\\repos\\PMDG_AUTO\\AirportData\\sidstar.tab.cpp"

#ifdef short
# undef short
#endif

#ifdef YYTYPE_UINT8
typedef YYTYPE_UINT8 yytype_uint8;
#else
